all files/loadTest.yaml
# Filename: 03-token-validation-test.yaml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 30 # 30 seconds
      arrivalRate: 1 # Conservative 1 request/sec
      name: 'Token Validation Test'

  # More stringent thresholds
  thresholds:
    - http.response_time.p95:
        threshold: 1200 # 1.2 seconds
        abortOnFail: false

scenarios:
  - name: 'Auth Token Validation'
    flow:
      # Step 1: Login
      - post:
          url: '/api/auth/login'
          json:
            email: 'staff1@test.com'
            password: 'test1234567'
          capture:
            json: '$.token'
            as: 'authToken'

      # Step 2: Validate token
      - get:
          url: '/api/auth/validate'
          headers:
            Authorization: 'Bearer {{ authToken }}'

      # Step 3: Log results
      - log: 'Validation status: {{ response.statusCode }}'
      - log: 'Token validation time: {{ response.timings.response }}ms'

      # Step 4: Cleanup
      - post:
          url: '/api/auth/logout'
          headers:
            Authorization: 'Bearer {{ authToken }}'